[
  {
    "id": 1,
    "title": "My First Blog Post",
    "date": "2024-10-24",
    "summary": "Welcome to my first blog post! In this post, I will share some thoughts about building this portfolio website using React.",
    "content": "Welcome to my first blog post! In this post, I will share some thoughts about building this portfolio website using React. Building a portfolio using React was an exciting journey where I explored the fundamentals of component-based development, routing, and styling with modern tools. I decided to use Vite for faster development and hot module replacement, which saved me a lot of time. Throughout this journey, I learned about state management, conditional rendering, and creating reusable components. This is just the beginning of my web development journey!\n\nOne of the key challenges I faced was managing state between components and maintaining a clean structure. Initially, my components were too large and complex, which made debugging and maintenance difficult. I had to restructure them by dividing larger components into smaller, reusable ones. This not only made my code more organized but also enhanced the overall efficiency of the project.\n\nI also experimented with different styling techniques. I started with traditional CSS but soon transitioned to CSS Modules to avoid conflicts. Later, I discovered styled-components, which allowed me to write CSS directly in my JavaScript files and use props to dynamically style elements. This technique felt more intuitive and streamlined my styling process.\n\nMoreover, I implemented responsive design principles to ensure that my website looked great on devices of all sizes. This involved using CSS media queries and testing on multiple screen sizes. Overall, building this portfolio website was a fulfilling experience that honed my React skills and prepared me for more complex projects in the future."
  },
  {
    "id": 2,
    "title": "Learning React",
    "date": "2024-10-25",
    "summary": "In this post, I'll walk you through some key concepts I learned while building a project with React and Vite.",
    "content": "In this post, I'll walk you through some key concepts I learned while building a project with React and Vite. When I started this project, I focused on setting up a development environment using Vite because it provided a fast and efficient workflow. I explored JSX syntax, learned about React hooks like useState and useEffect, and got hands-on experience with routing using React Router. One of the challenges I faced was managing state between components, which led me to explore different state management approaches. Overall, it was a fantastic experience diving deeper into the React ecosystem!\n\nThe biggest hurdle during this project was understanding state and prop drilling. I initially struggled with passing state between components, and at times, the code felt convoluted. To solve this, I researched and implemented the Context API, which greatly simplified the process. The Context API helped me centralize and distribute state more effectively throughout the component tree.\n\nI also learned about React Router, which allowed me to implement dynamic routes and create a more intuitive navigation experience. I experimented with nested routes and parameter-based routing to display content dynamically based on user actions.\n\nAnother area I explored was form handling in React. I used controlled components to manage form state and experimented with validation techniques. Later, I implemented third-party libraries like Formik to simplify the code and handle complex forms more efficiently. By the end of this project, I had a much deeper understanding of state management, routing, and form handling in React. I’m excited to continue exploring this library and its ecosystem."
  }
]
